app/views/vm_details/list_products.html.erb

                          <td><%= vmd.product_id %></td>
                          <td><%= Product.find(vmd.product_id).name %></td>
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 5 LIMIT 1