app/controllers/productdetails_controller.rb

  def show
    machineid = params[:machineid]
    @machine = Vendingmachine.find_by_id(machineid)
---
SELECT  `vendingmachines`.* FROM `vendingmachines` WHERE `vendingmachines`.`id` = 1 LIMIT 1