app/controllers/vendor_controller.rb

  def create

    p=params[:product]
    product_name = p[:name]
    puts "HEEEEEEEEEEEEEEEEEEEEE"

    @product = Product.find_by_name(product_name)
    puts @product
    puts product_name
    if @product
      puts "product_id---------------------------------------"
      puts @product.id
      redirect_to(:controller =>'vm_details', :action => 'add_quantity', :vendingmachines_id =>params[:vendingmachines_id], :p_id => @product.id, :quantity => p[:quantity])
    else
      @product=Product.new(:name=>p[:name], :price => p[:price], :active => p[:quantity])
      @product.save!
---
SELECT  `products`.* FROM `products` WHERE `products`.`name` = 'p' LIMIT 1
INSERT INTO `products` (`name`, `price`, `active`, `created_at`, `updated_at`) VALUES ('pepsi', 3.0, 1, '2017-06-06 20:24:33', '2017-06-06 20:24:33')

  def login_check
    p=params[:vendor]
    @user = Vendor.find_by_name(p[:name])
---
SELECT  `vendors`.* FROM `vendors` WHERE `vendors`.`name` = 'sek' LIMIT 1