app/controllers/vm_details_controller.rb

SELECT  `vm_details`.* FROM `vm_details` WHERE `vm_details`.`vendingmachine_id` IS NULL AND `vm_details`.`product_id` IS NULL LIMIT 1
UPDATE `vm_details` SET `quantity` = 10, `updated_at` = '2017-06-06 20:57:01' WHERE `vm_details`.`id` = 2
INSERT INTO `vm_details` (`vendingmachine_id`, `product_id`, `quantity`, `created_at`, `updated_at`) VALUES (1, 5, 5, '2017-06-06 20:28:38', '2017-06-06 20:28:38')
---
  def add_quantity
    puts params[:vendingmachine_id]
    puts params[:p_id]
    puts params[:quantity]
    # @permission = Permission.find_by_user_id_and_project_id(params[:user_id],params[:project_id])
    @vm_details= VmDetail.find_by_vendingmachine_id_and_product_id( 1,params[:p_id])
    if @vm_details
      quantity=Integer(@vm_details[:quantity]) + Integer(params[:quantity])
      # puts quantity
      #@vm_details[:quantity]= quantity
      #puts @vm_details[:quantity]
      @vm_details.update(:quantity => quantity)
    else
      @vm_details=VmDetail.new(:vendingmachine_id => 1, :product_id=>params[:p_id],:quantity => params[:quantity])
    end

    if @vm_details.save

SELECT `vm_details`.* FROM `vm_details` WHERE `vm_details`.`vendingmachine_id` IS NULL
---
  def list_products
    @vm_details = VmDetail.where(vendingmachine_id: 1)

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 25
SELECT  `vm_details`.* FROM `vm_details` WHERE `vm_details`.`product_id` = 4 LIMIT 1
UPDATE `vm_details` SET `quantity` = -2, `updated_at` = '2017-06-08 15:13:27' WHERE `vm_details`.`id` = 5
---
  def subtract_quantity
    @order_items = current_order.order_items
    @order_items.each do |order_item|
      @vm_details = VmDetail.find_by_product_id(order_item.product.id)
      puts @vm_details
      puts "---in the loop===="
      puts order_item.product.name
      quantity= order_item.quantity
      updated_quantity = Integer(@vm_details[:quantity]) - Integer(quantity)
      @vm_details.update(:quantity => updated_quantity)