app/views/products/_product_row.html.erb

      <h4> Available </h5>
      <%= value = VmDetail.where(:product_id => product.id)[0]&.quantity %>
---
SELECT `vm_details`.* FROM `vm_details` WHERE `vm_details`.`product_id` = 1