app/views/layouts/_cart_text.html.erb

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 AND `order_items`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `order_items` WHERE `order_items`.`order_id` = 1
---
<%= link_to "PROCEED with #{current_order.order_items.size} Items in Cart (PAY -- #{number_to_currency current_order.subtotal} )", controller: "vm_details", action: "subtract_quantity", class: "btn btn-link" %>